    FROM golang:1.16-alpine3.13 AS builder
    # Создаём директроию
    WORKDIR /app

    #Копируем все файлы в папку app с помощью функции COPY
    #Первая точка означает что мы копируем всё из текущей папки где мы запускаем docker build
    #для создания образа, все что находится в папке ascii-art-stylize будет скопированно в image(образ)

    #Вторая точка это текущий раbочий каталог внутри образа куда копируются файлы и папки
    COPY . . 

    #Далее мы создадим приложение в виде одного исполняемого файла (-o означат output)
    #Затем имя выходного бинарного файла и место точки вохода
    RUN go build -o main cmd/main.go

    #После того как будет создан бинарный файл мы создадис второй этап
    #Мы используем инструкцию FROM чтобы указать базовый образ 
    #для этого этапа запуска и по скольку мы хотим чтобы размер выходного образа был небольшим 
    #мы будем использовать ос линукс в качестве базового образа
    FROM alpine:3.13

    #Также как и раньше мы устанавливаем текущий рабочий каталог
    WORKDIR /app

    #Теперь нам нужно скопировать дваичный файл со стадии сборки в этот образ стадии запуска
    #Но на этот раз мы используем атрибут --from чтобы указать docker от куда копировать файл
    #В этом случае он должен бать скопирован со стадии builder
    #За тем путь к файлу который мы хотим скопировать и целевое место положение вконечном образе 
    #для копирования этого файла которое должно быть текущей рабочей папкой 
    #(.) предстовляет рабочий каталог который мы установили выше (app)
    COPY --from=builder /app/main .

    #Инструкция для информирования docker о том что контейнер прослушивает указанный сетевой порт 8080
    #во время выполнения
    #Эта инструкция не публикует порт, он функционирует как документация между тем кто создаёт образ 
    #и тем кто запускат контейнер о том какие порты предназначены
    EXPOSE 8080

    #Определяем команду по умолчанию которая будет выполняться при запуске контейнера
    #Для этой цели мы используем команду CMD - это массив аргументов командной строки
    CMD [ "app/main" ]